<template>
  <div class='card'>
      <div class="background">
        <image class="backgroundpic" src='https://system.lib.whu.edu.cn/mp-static/馆长寄语/timg@2x.png'/>
        <div class="update">
            <div>
                <span>&nbsp;&nbsp;&nbsp;&nbsp;武汉大学图书馆以其历史悠久、藏书丰富、建筑宏伟、环境幽雅而闻名于世。图书馆源于1893年清末湖广总督张之洞创办的湖北自强学堂图书室，1917 年正式建馆，1928 年定名为国立武汉大学图书馆。1935年启用坐落在东湖之滨、狮子山顶的老图书馆大楼。武汉大学图书馆老馆及其周围的建筑群，被列入第五批全国重点文物保护单位，这在国内图书馆界绝无仅有。</span>
            </div>
            <div>
                <span>&nbsp;&nbsp;&nbsp;&nbsp;1985年在校园中心又建成了一座新图书馆。2000年8月，武汉大学与武汉水利电力大学、武汉测绘科技大学、湖北医科大学合并，四校图书馆也相应合并为新的武汉大学图书馆。2011年10月，总建筑面积为35548平方米的武汉大学图书馆（总馆）新馆落成启用，图书馆的服务功能得到进一步提高。全校现有图书馆馆舍面积为62403平方米，资料室为15601平方米，总面积达到 78004平方米。&#10;</span>
            </div>
            <div>
                <span>&nbsp;&nbsp;&nbsp;&nbsp;截至2017年12月，文献资源总量达1710万余册。印刷型文献共655万册，其中图书531万册，报刊合订本90万册，地图、声像、缩微资料17万件，学位论文17万册；2017年订购各类文献数据库506个，中外文电子书刊达1055万册，其中电子图书869万册，电子期刊186万册。图书馆藏有古籍20余万册，有300多种收入《中国古籍善本书目》，66种入选《国家珍贵古籍名录》。学科覆盖面广，遍及文、理、工、农、医等各个领域，其中尤以我校重点学科文献的收藏最为完整。除此之外，武汉大学图书馆与国内外140 多所图书馆和学术机构建立了文献交换关系，图书馆文献保障能力进一步增强。&#10;
                </span>
            </div>
            <div>
                <span>&nbsp;&nbsp;&nbsp;&nbsp;全馆现设资源建设中心、文献借阅中心、信息服务中心、工学分馆、信息科学分馆、医学分馆等三个中心和三个分馆。在全国文献资源调查中，武汉大学图书馆有21个学科的藏书被评为“研究级藏书”，水利工程、动力工程、电力工程、测绘制图等专业的中外文书刊保障率位居全国榜首，馆内还收藏有自 1907 年以来近一个世纪的生物医学检索信息；各种比例尺国家基本地形图和航空航天地球摄影照近10万件。其中，文献借阅中心主要收藏哲学、历史、经济、政治、法律、管理、语言、文学、数学、物理、化学、生物等类文献；工学分馆主要收藏水利、电工、动力、土木建筑、电子、机械、城市建设与规划、工业与民用建筑等类文献；信息科学分馆主要收藏工程测量、摄影测量与遥感、计算机科学、大地测量、地理信息工程、地图制图、印刷技术、光学电子仪器设计与制造、电子信息技术等类文献；医学分馆主要收藏基础医学、临床医学、护理学、医学管理学、口腔医学等类文献。全校35个院系、研究中心及实验室设有图书资料室，在业务上由总馆统一领导，共同组成学校的文献服务网络。
      近年来，图书馆大力加强网络化和数字化文献资源的建设，对文献资源建设类型进行了适时调整，逐年加大对电子资源的收藏力度，并取得了明显成效。经过几年的建设，图书馆各类型电子文献逐渐成为学术信息资源的主要形式，数字化文献信息资源体系已具有一定的规模，数字化文献资源总量居全国高校的前列，数据库内容已经基本涵盖我校所有学科专业，其类型以全文数据库居多，文摘数据库次之；而数据库包含的文献类型以及时反映最新学术成果的期刊为主，兼及图书、会议论文、科技报告、学位论文、技术标准、产品样本、专利等各类。初步建成印刷型文献和数字化文献相结合的文献保障服务体系。</span>
            </div>
            <div>
                <span>&nbsp;&nbsp;图书馆服务功能完备，拥有多种现代化的服务手段，可为读者提供外借、阅览、听音收视、参考咨询、文献检索、定题服务、课题查新、读者教育、馆际互借、文献复制、文献传递等多类型、多层次的服务。图书馆现拥有服务器、各种计算机终端和外部设备近 2800 台（套），建成了高带宽的馆内局域网和电子信息服务系统，可通过国家教育科研网（ CERNET ）和互联网（ INTERNET ）向网上用户提供文献服务。读者可通过计算机检索本馆的文献收藏信息、文献数据库及网上资源。全校设有十个各级文献中心，分别是中国高等教育文献保障系统(CALIS)华中地区中心和湖北省文献信息中心、中国高校人文社会科学文献中心（CASHL）华中区域中心、教育部引进文科图书中心书库、教育部生命科学外国教材中心、大学数字图书馆国际合作计划（CADAL）服务中心、教育部科技查新站、欧洲资料中心、世界银行资料保存图书馆和联合国资料保存图书馆，为全国高校及社会用户提供服务。</span>
            </div>
            <div>
                <span>&nbsp;&nbsp;百年名校，人文荟萃；珞珈山下，卷帙飘香。武汉大学图书馆以其搜罗宏富的藏书和良好的网络信息服务平台成为莘莘学子博览群书、涉猎各科知识、获取各种信息的重要场所，传播知识的圣殿，孕育人才的第二课堂。现代信息服务环境下的图书馆员将以忠诚的敬业精神和热情周到的服务引导大家度过在武汉大学的求学时光。    
                </span>
            </div>
        </div>
      </div>
  </div>
</template>

<script>
export default {
  mpType: 'page',
  onLoad(options) {
    wx.setNavigationBarTitle({
      title: '馆长寄语',
    });
  },
  data: {
  },
  methods: {
  },
};
</script>

<style lang="scss" scoped>
.card{
  width: 100vw;
  height: 100vh;
  padding: 0;
  margin: 0;
  .pic{
    width:171rpx;
    height:171rpx;
    position:absolute;
    z-index:0;
    left:513rpx;
    top:1rpx;
  }
  .background{
    width:718rpx;
    height:1704rpx;
    z-index:-1;
    position:absolute;
    left:12rpx;
    top:74rpx;
    .backgroundpic{
        width:718rpx;
        height:1104rpx;
    }
    .update{
        z-index: 1;
        display: flex;
        justify-content: center;
        align-items: center;
        margin: auto;
        position: absolute;
        flex-wrap: wrap;
        -webkit-flex-direction: row;
        flex-direction: row;
        left: 34rpx;
        top: 77rpx;
        width: 84%;
        height: 100%;
        padding: 15rpx;
        div{
            width:100%;
            span{
                color:#3a3a3a;
                font-size: 24rpx;
            }
        }
    }
  }
}
</style>
